src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <predefined>
    <items>
      <name>Неопределен</name>
      <description>Неопределен</description>
    </items>
  </predefined>
  <attributes>
    <name>URLGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПроектаGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PathGitClone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимыРаботыКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСборкиРелиза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевШара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьКонфигурациюВРелиз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяJobJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаАктуальныхОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляАктуализацииОбработок</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаРасширенийДляАктуализацииОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРепозитория</name>
    <type>
      <types>EnumRef.ТипРепозитория</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Проекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогРепозиториевПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозиториевПроекта;  
	ДиалогОткрытия.Заголовок = "Выберите каталог репозиториев проекта"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаРепозиториев_Завершение", ЭтотОбъект, "" ));
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСборкиРелизаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозиториевПроекта;  
	ДиалогОткрытия.Заголовок = "Выберите каталог сборки релизов"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаСборкиРелизов_Завершение", ЭтотОбъект, "" ));
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КаталогРепозиториевШараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозиториевПроекта;  
	ДиалогОткрытия.Заголовок = "Выберите каталог сборки релизов на шаре"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаРепозиториевШара_Завершение", ЭтотОбъект, "" ));
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКаталогаРепозиториев_Завершение(Результат, Параметр) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогРепозиториевПроекта = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаСборкиРелизов_Завершение(Результат, Параметр) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогСборкиРелиза = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаРепозиториевШара_Завершение(Результат, Параметр) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогРепозиториевШара = Результат[0];
	
КонецПроцедуры

#КонецОбласти
